Autodesk.Navisworks.Api.AnimationBehavior
Animation behavior as applied by the TimeLiner simulation engine.

Autodesk.Navisworks.Api.AnimationBehavior.Scale
The animation duration is scaled to be same as task duration.

Autodesk.Navisworks.Api.AnimationBehavior.Start
The animation starts when the task starts. The animation may be clipped if the task finishes before animation does.

Autodesk.Navisworks.Api.AnimationBehavior.End
The animation starts so that it ends when the task ends. The animation start is clipped (starts part way through) if the animation needs to start before task does.